Tekla Open API Reference for Tekla Structures 2025
AnalysisModelHandler.SetActiveModel Method
 Sets the active model. The AnalysisModelName or ID has to be set.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetActiveModel(
	AnalysisModel AnalysisModel
)
Public Sub SetActiveModel (
	AnalysisModel As AnalysisModel
)
Parameters
AnalysisModel
Type: Tekla.Structures.Analysis.AnalysisModel
The analysis model to be used.
See Also
Reference
AnalysisModelHandler Class
Tekla.Structures.Analysis Namespace